OdDAI.Select.getEnum(System.UInt32!System.Runtime.CompilerServices.IsLong*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as a unsigned long value.
\param ret [out] A placeholder for the value to be returned to a calling subroutine.
\returns Returns true if the value was successfully converted and returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.setEnum(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets a new value represented with a unsigned long value.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select._d
\details
Retrieves the "Select" data type determinant.
\returns Returns a long value that represents the type determinant.

OdDAI.Select.op_LessThan(OdDAI.Select!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The greater operator for the "Select" value.
\param other [in] other value (right-hand operand of the greater operation).
\returns Returns false if other greater than this, or false in other case.
\remarks
The operator makes a deep copy of underlying data of the right-hand operand and assigns it to this "Select" value.

OdDAI.Select.#ctor
\details
Creates a new "Select" value.